//
////0 ^ 0 = 0，0 ^ 1 = 1，1 ^ 1 = 0
//
////a&a=a
////a|a=a
////a^a=0
//
////a&0=0
////a|0=a
////a^0=a
//
////去掉最后一位		x>>1
////在最后加一个0		x<<1
////在最后加一个1		(x<<1)+1
//
////把最后一位变成1	x|1
////把最后一位变成0	(x|1)-1
////最后一位取反		x^1
//
////把右数第k位变成1	x|(1<<(k-1))
////把右数第k位变成0	x&(~(1<<(k-1)))
////把右数第k位取反	x^(1<<(k-1))
//
////提取右数最右侧的1，其余位为0		x&(-x)
//
//
//#include<iostream>
//#include<vector>
//#include<cstdint>
//using namespace std;
//
////计算x在二进制下1的个数
//int popcount(int x) {
//    int res = 0;
//    while (x) {  
//        x &= (x - 1);  // 清除最右侧的一个 1
//        res++;
//    }
//    return res;
//}
