#define _CRT_SECURE_NO_WARNINGS 1

//矩阵A	矩阵B	矩阵C
//1	2	5	6	19	22
//3	4	7	8	43	50
//c11=1*5+2*7=19
//c12=1*6+2*8=22
//c21=3*5+4*7=43
//c22=3*6+4*8=50


//设 A 和 B 是 2×2 矩阵：
//A = [a, b],
//	[c, d]
//B = [e, f],
//	[g, h]
//C = [ae + bg, af + bh],
//	[ce + dg, cf + dh]
//构造 7 个中间矩阵（仅需 7 次乘法）：
//M₁ = a ×(f - h)
//M₂ = (a + b) × h
//M₃ = (c + d) × e
//M₄ = d ×(g - e)
//M₅ = (a + d) ×(e + h)
//M₆ = (b - d) ×(g + h)
//M₇ = (a - c) ×(e + f)
//通过加减法推导 C 的元素：
//C₁₁ = M₅ + M₄ - M₂ + M₆
//C₁₂ = M₁ + M₂
//C₂₁ = M₃ + M₄
//C₂₂ = M₅ - M₃ + M₁ - M₇

